<!-- dflook/terraform-github-actions {"workspace":"default","backend":"7ea673dc1a8a9dcebbd1babd11ed981a317d96a4d96792bb91cc18fddf3eee5d","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #274 at https://github.com/dflook/terraform-github-actions/actions/runs/3496421993","plan_hash":"9d4ba801f477feb110d2e0159ef05229b40b6d573a983b8a08d48f107fcfacb6","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "cnv8GAMty3" -> (known after apply)
  ~ foreach = "162imH2LXA" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #274](https://github.com/dflook/terraform-github-actions/actions/runs/3496421993)